Revit 2026 API

# ElementMulticategoryFilter(ICollectionElementId) Constructor

---

Initializes a new instance of the ElementMulticategoryFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticategoryFilter(
	ICollection<ElementId> categoryIds
)
```
```vb
Public Sub New (
	categoryIds As ICollection(Of ElementId)
)
```
```cpp
public:
ElementMulticategoryFilter(
	ICollection<ElementId^>^ categoryIds
)
```
```fsharp
new :
        categoryIds : ICollection<ElementId> -> ElementMulticategoryFilter
```

#### Parameters

categoryIds ICollectionElementId

#### Reference

ElementMulticategoryFilter Class

ElementMulticategoryFilter Overload

Autodesk.Revit.DB Namespace